3) Liste os nomes de todos os produtos que custam mais de 100 reais, ordenando-os primeiramente pelo preço e em segundo lugar pelo nome. Use alias para mostrar o nome da coluna nome como "Produto" e da coluna preco como "Valor". A resposta da consulta não deve mostrar outras colunas de dados.

In [ ]:
SELECT nome AS "Produto", preco AS "Valor" FROM produtos
	WHERE preco > 100 ORDER BY preco, nome;

4) Liste todos os ids e preços de produtos cujo preço seja maior do que a média de todos os preços encontrados na tabela "produtos".

In [ ]:
SELECT id, preco FROM produtos
    WHERE preco > (SELECT AVG(preco) FROM produtos);

5) Para cada categoria, mostre o preço médio do conjunto de produtos a ela associados. Caso uma categoria não tenha nenhum produto a ela associada, esta categoria não deve aparecer no resultado final. A consulta deve estar ordenada pelos nomes das categorias.

In [ ]:
SELECT c.nome AS "Categoria", 
	AVG(p.preco) AS "Preço Médio" FROM categorias c
	JOIN produtos_categorias pc ON c.id = pc.categoria_id
	JOIN produtos p ON pc.produto_id = p.id
	GROUP BY c.id, c.nome ORDER BY c.nome;

6) Com o objetivo de demonstrar o seu conhecimento através de um exemplo contextualizado com o dia-a-dia da escola, utilize os comandos do subgrupo de funções DDL para construir o banco de dados simples abaixo, que representa um relacionamento do tipo 1,n entre as entidades "aluno" e "turma":

Tabela 1

    Nome da tabela: aluno
    Colunas da tabela: id_aluno (INT), nome_aluno (VARCHAR), aluno_alocado (BOOLEAN), id_turma (INT)

Tabela 2

    Nome da tabela: turma
    Colunas da tabela: id_turma (INT), código_turma (VARCHAR), nome_turma (VARCHAR)

In [ ]:
CREATE TABLE turma (
    id_turma SERIAL PRIMARY KEY,
    codigo_turma VARCHAR(20) NOT NULL,
    nome_turma VARCHAR(100) NOT NULL
);
CREATE TABLE aluno (
    id_aluno SERIAL PRIMARY KEY,
    nome_aluno VARCHAR(100) NOT NULL,
    aluno_alocado BOOLEAN NOT NULL,
    id_turma INT REFERENCES turma(id_turma)
);

7) Agora que você demonstrou que consegue ser mais do que um simples usuário do banco de dados, mostre separadamente cada um dos códigos DML necessários para cumprir cada uma das etapas a seguir:

a) Inserir pelo menos duas turmas diferentes na tabela de turma;

In [ ]:
INSERT INTO turma (codigo_turma, nome_turma) VALUES
    ('TCDA', 'Turma de Ciência de Dados A'),
    ('TBEB', 'Turma de BackEnd B');

b) Inserir pelo menos 1 aluno alocado em cada uma destas turmas na tabela aluno (todos com NULL na coluna aluno_alocado);

In [ ]:
INSERT INTO aluno (nome_aluno, aluno_alocado, id_turma)
	VALUES ('Ash Ketchum', NULL, 1),('Light Yagami', NULL, 2);

c) Inserir pelo menos 2 alunos não alocados em nenhuma turma na tabela aluno (todos com NULL na coluna aluno_alocado);

In [ ]:
INSERT INTO aluno (nome_aluno, aluno_alocado, id_turma)
	VALUES ('Harry Potter', NULL, NULL),('Lebron James', NULL, NULL);

d) Atualizar a coluna aluno_alocado da tabela aluno, de modo que os alunos associados a uma disciplina recebam o valor True e alunos não associdos a nenhuma disciplina recebam o falor False para esta coluna.

In [ ]:
UPDATE aluno SET aluno_alocado = CASE
    WHEN id_turma IS NOT NULL THEN TRUE
    ELSE FALSE
    END;